SIM/constant/fluid/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      physicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
    transport       const;
    thermo          hConst;
    equationOfState rhoConst;
    specie          specie;
    energy          sensibleEnthalpy;
}

mixture
{
    // Air
    specie
    {
        molWeight   28.966;         // [g/mol]
    }
    equationOfState
    {
        rho         1.225;     // [kg/m^3]
    }
    thermodynamics
    {
        Cp          1006.43;       // [J/kg/K]
        Hf          0;
    }
    transport
    {
        mu          1.7894e-05;  // [kg/m/s]
        Pr          0.71;
    }  
}


// ************************************************************************* //
