SIM/0/fluid/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

Uinlet          (0 1 0);

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 1 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform $Uinlet;
    }

    outlet
    {
        type              zeroGradient;
        //type            pressureInletOutletVelocity;
        //value           $internalField;
    }

    left
    {
        type            slip;
    }
    right
    {
        type            slip;
    }

    fluid_to_solid
    {
        type            noSlip;
        //type              fixedValue;
        //value             uniform (0 0 0);
    }

    //#includeEtc "caseDicts/setConstraintTypes"
}


// ************************************************************************* //
