SIM/system/solid/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system/porous";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "p_rgh.*"
    {
        solver           GAMG;
        tolerance        1e-7;
        relTol           0.01;
        smoother         DIC;
        maxIter          10;
    }

    "(U|h|e|k|epsilon).*"
    {
        solver           PBiCGStab;
        preconditioner   DIC;
        tolerance        1e-7;
        relTol           0.1;
    }
}

PIMPLE
{
    nNonOrthogonalCorrectors 0;
     
     outerResidualControl 
    {
	".*" 
	{
		tolerance 1e-3;
		relTol 	0;
	}
    }
}

relaxationFactors
{
    fields
    {
        rho             1;
        p_rgh           0.7;
    }

    equations
    {
        U               0.4;
        "(h|e)"         1;//0.3;
        k               0.4;
        epsilon         0.4;
    }
}

// ************************************************************************* //
