SIM/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "$FOAM_CASE/system/blockMeshDict"

actions
(
 //fluid1
    {
        name    fluid;
        type    cellSet;
        action  new;
        source  zoneToCell;
        sourceInfo
        {
             name	"fluid";
        }
    }

    {
        name    fluid;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set fluid;
        }
    }


    //solid
        {
        name    solid;
        type    cellSet;
        action  new;
        source  zoneToCell;
        sourceInfo
        {
             name	"solid";
        }
    }

    {
        name    solid;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set solid;
        }
    }

);
