SIM/Allrun
./Allclean
./Allmesh
source /opt/openfoam10/etc/bashrc
rm -r 100
#./mychtMultiRegionFoam
chtMultiRegionFoam
